Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.10.212/samv70b/include/component/hsmci.h
/*
 * Component description for HSMCI
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-03-27T04:10:41Z */
#ifndef _SAMV70_HSMCI_COMPONENT_H_
#define _SAMV70_HSMCI_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR HSMCI                                        */
/* ************************************************************************** */

/* -------- HSMCI_CR : (HSMCI Offset: 0x00) ( /W 32) Control Register -------- */
#define HSMCI_CR_MCIEN_Pos                    _UINT32_(0)                                          /* (HSMCI_CR) Multi-Media Interface Enable Position */
#define HSMCI_CR_MCIEN_Msk                    (_UINT32_(0x1) << HSMCI_CR_MCIEN_Pos)                /* (HSMCI_CR) Multi-Media Interface Enable Mask */
#define HSMCI_CR_MCIEN(value)                 (HSMCI_CR_MCIEN_Msk & (_UINT32_(value) << HSMCI_CR_MCIEN_Pos)) /* Assigment of value for MCIEN in the HSMCI_CR register */
#define HSMCI_CR_MCIDIS_Pos                   _UINT32_(1)                                          /* (HSMCI_CR) Multi-Media Interface Disable Position */
#define HSMCI_CR_MCIDIS_Msk                   (_UINT32_(0x1) << HSMCI_CR_MCIDIS_Pos)               /* (HSMCI_CR) Multi-Media Interface Disable Mask */
#define HSMCI_CR_MCIDIS(value)                (HSMCI_CR_MCIDIS_Msk & (_UINT32_(value) << HSMCI_CR_MCIDIS_Pos)) /* Assigment of value for MCIDIS in the HSMCI_CR register */
#define HSMCI_CR_PWSEN_Pos                    _UINT32_(2)                                          /* (HSMCI_CR) Power Save Mode Enable Position */
#define HSMCI_CR_PWSEN_Msk                    (_UINT32_(0x1) << HSMCI_CR_PWSEN_Pos)                /* (HSMCI_CR) Power Save Mode Enable Mask */
#define HSMCI_CR_PWSEN(value)                 (HSMCI_CR_PWSEN_Msk & (_UINT32_(value) << HSMCI_CR_PWSEN_Pos)) /* Assigment of value for PWSEN in the HSMCI_CR register */
#define HSMCI_CR_PWSDIS_Pos                   _UINT32_(3)                                          /* (HSMCI_CR) Power Save Mode Disable Position */
#define HSMCI_CR_PWSDIS_Msk                   (_UINT32_(0x1) << HSMCI_CR_PWSDIS_Pos)               /* (HSMCI_CR) Power Save Mode Disable Mask */
#define HSMCI_CR_PWSDIS(value)                (HSMCI_CR_PWSDIS_Msk & (_UINT32_(value) << HSMCI_CR_PWSDIS_Pos)) /* Assigment of value for PWSDIS in the HSMCI_CR register */
#define HSMCI_CR_SWRST_Pos                    _UINT32_(7)                                          /* (HSMCI_CR) Software Reset Position */
#define HSMCI_CR_SWRST_Msk                    (_UINT32_(0x1) << HSMCI_CR_SWRST_Pos)                /* (HSMCI_CR) Software Reset Mask */
#define HSMCI_CR_SWRST(value)                 (HSMCI_CR_SWRST_Msk & (_UINT32_(value) << HSMCI_CR_SWRST_Pos)) /* Assigment of value for SWRST in the HSMCI_CR register */
#define HSMCI_CR_Msk                          _UINT32_(0x0000008F)                                 /* (HSMCI_CR) Register Mask  */


/* -------- HSMCI_MR : (HSMCI Offset: 0x04) (R/W 32) Mode Register -------- */
#define HSMCI_MR_CLKDIV_Pos                   _UINT32_(0)                                          /* (HSMCI_MR) Clock Divider Position */
#define HSMCI_MR_CLKDIV_Msk                   (_UINT32_(0xFF) << HSMCI_MR_CLKDIV_Pos)              /* (HSMCI_MR) Clock Divider Mask */
#define HSMCI_MR_CLKDIV(value)                (HSMCI_MR_CLKDIV_Msk & (_UINT32_(value) << HSMCI_MR_CLKDIV_Pos)) /* Assigment of value for CLKDIV in the HSMCI_MR register */
#define HSMCI_MR_PWSDIV_Pos                   _UINT32_(8)                                          /* (HSMCI_MR) Power Saving Divider Position */
#define HSMCI_MR_PWSDIV_Msk                   (_UINT32_(0x7) << HSMCI_MR_PWSDIV_Pos)               /* (HSMCI_MR) Power Saving Divider Mask */
#define HSMCI_MR_PWSDIV(value)                (HSMCI_MR_PWSDIV_Msk & (_UINT32_(value) << HSMCI_MR_PWSDIV_Pos)) /* Assigment of value for PWSDIV in the HSMCI_MR register */
#define HSMCI_MR_RDPROOF_Pos                  _UINT32_(11)                                         /* (HSMCI_MR) Read Proof Enable Position */
#define HSMCI_MR_RDPROOF_Msk                  (_UINT32_(0x1) << HSMCI_MR_RDPROOF_Pos)              /* (HSMCI_MR) Read Proof Enable Mask */
#define HSMCI_MR_RDPROOF(value)               (HSMCI_MR_RDPROOF_Msk & (_UINT32_(value) << HSMCI_MR_RDPROOF_Pos)) /* Assigment of value for RDPROOF in the HSMCI_MR register */
#define HSMCI_MR_WRPROOF_Pos                  _UINT32_(12)                                         /* (HSMCI_MR) Write Proof Enable Position */
#define HSMCI_MR_WRPROOF_Msk                  (_UINT32_(0x1) << HSMCI_MR_WRPROOF_Pos)              /* (HSMCI_MR) Write Proof Enable Mask */
#define HSMCI_MR_WRPROOF(value)               (HSMCI_MR_WRPROOF_Msk & (_UINT32_(value) << HSMCI_MR_WRPROOF_Pos)) /* Assigment of value for WRPROOF in the HSMCI_MR register */
#define HSMCI_MR_FBYTE_Pos                    _UINT32_(13)                                         /* (HSMCI_MR) Force Byte Transfer Position */
#define HSMCI_MR_FBYTE_Msk                    (_UINT32_(0x1) << HSMCI_MR_FBYTE_Pos)                /* (HSMCI_MR) Force Byte Transfer Mask */
#define HSMCI_MR_FBYTE(value)                 (HSMCI_MR_FBYTE_Msk & (_UINT32_(value) << HSMCI_MR_FBYTE_Pos)) /* Assigment of value for FBYTE in the HSMCI_MR register */
#define HSMCI_MR_PADV_Pos                     _UINT32_(14)                                         /* (HSMCI_MR) Padding Value Position */
#define HSMCI_MR_PADV_Msk                     (_UINT32_(0x1) << HSMCI_MR_PADV_Pos)                 /* (HSMCI_MR) Padding Value Mask */
#define HSMCI_MR_PADV(value)                  (HSMCI_MR_PADV_Msk & (_UINT32_(value) << HSMCI_MR_PADV_Pos)) /* Assigment of value for PADV in the HSMCI_MR register */
#define HSMCI_MR_CLKODD_Pos                   _UINT32_(16)                                         /* (HSMCI_MR) Clock divider is odd Position */
#define HSMCI_MR_CLKODD_Msk                   (_UINT32_(0x1) << HSMCI_MR_CLKODD_Pos)               /* (HSMCI_MR) Clock divider is odd Mask */
#define HSMCI_MR_CLKODD(value)                (HSMCI_MR_CLKODD_Msk & (_UINT32_(value) << HSMCI_MR_CLKODD_Pos)) /* Assigment of value for CLKODD in the HSMCI_MR register */
#define HSMCI_MR_Msk                          _UINT32_(0x00017FFF)                                 /* (HSMCI_MR) Register Mask  */


/* -------- HSMCI_DTOR : (HSMCI Offset: 0x08) (R/W 32) Data Timeout Register -------- */
#define HSMCI_DTOR_DTOCYC_Pos                 _UINT32_(0)                                          /* (HSMCI_DTOR) Data Timeout Cycle Number Position */
#define HSMCI_DTOR_DTOCYC_Msk                 (_UINT32_(0xF) << HSMCI_DTOR_DTOCYC_Pos)             /* (HSMCI_DTOR) Data Timeout Cycle Number Mask */
#define HSMCI_DTOR_DTOCYC(value)              (HSMCI_DTOR_DTOCYC_Msk & (_UINT32_(value) << HSMCI_DTOR_DTOCYC_Pos)) /* Assigment of value for DTOCYC in the HSMCI_DTOR register */
#define HSMCI_DTOR_DTOMUL_Pos                 _UINT32_(4)                                          /* (HSMCI_DTOR) Data Timeout Multiplier Position */
#define HSMCI_DTOR_DTOMUL_Msk                 (_UINT32_(0x7) << HSMCI_DTOR_DTOMUL_Pos)             /* (HSMCI_DTOR) Data Timeout Multiplier Mask */
#define HSMCI_DTOR_DTOMUL(value)              (HSMCI_DTOR_DTOMUL_Msk & (_UINT32_(value) << HSMCI_DTOR_DTOMUL_Pos)) /* Assigment of value for DTOMUL in the HSMCI_DTOR register */
#define   HSMCI_DTOR_DTOMUL_1_Val             _UINT32_(0x0)                                        /* (HSMCI_DTOR) DTOCYC  */
#define   HSMCI_DTOR_DTOMUL_16_Val            _UINT32_(0x1)                                        /* (HSMCI_DTOR) DTOCYC x 16  */
#define   HSMCI_DTOR_DTOMUL_128_Val           _UINT32_(0x2)                                        /* (HSMCI_DTOR) DTOCYC x 128  */
#define   HSMCI_DTOR_DTOMUL_256_Val           _UINT32_(0x3)                                        /* (HSMCI_DTOR) DTOCYC x 256  */
#define   HSMCI_DTOR_DTOMUL_1024_Val          _UINT32_(0x4)                                        /* (HSMCI_DTOR) DTOCYC x 1024  */
#define   HSMCI_DTOR_DTOMUL_4096_Val          _UINT32_(0x5)                                        /* (HSMCI_DTOR) DTOCYC x 4096  */
#define   HSMCI_DTOR_DTOMUL_65536_Val         _UINT32_(0x6)                                        /* (HSMCI_DTOR) DTOCYC x 65536  */
#define   HSMCI_DTOR_DTOMUL_1048576_Val       _UINT32_(0x7)                                        /* (HSMCI_DTOR) DTOCYC x 1048576  */
#define HSMCI_DTOR_DTOMUL_1                   (HSMCI_DTOR_DTOMUL_1_Val << HSMCI_DTOR_DTOMUL_Pos)   /* (HSMCI_DTOR) DTOCYC Position  */
#define HSMCI_DTOR_DTOMUL_16                  (HSMCI_DTOR_DTOMUL_16_Val << HSMCI_DTOR_DTOMUL_Pos)  /* (HSMCI_DTOR) DTOCYC x 16 Position  */
#define HSMCI_DTOR_DTOMUL_128                 (HSMCI_DTOR_DTOMUL_128_Val << HSMCI_DTOR_DTOMUL_Pos) /* (HSMCI_DTOR) DTOCYC x 128 Position  */
#define HSMCI_DTOR_DTOMUL_256                 (HSMCI_DTOR_DTOMUL_256_Val << HSMCI_DTOR_DTOMUL_Pos) /* (HSMCI_DTOR) DTOCYC x 256 Position  */
#define HSMCI_DTOR_DTOMUL_1024                (HSMCI_DTOR_DTOMUL_1024_Val << HSMCI_DTOR_DTOMUL_Pos) /* (HSMCI_DTOR) DTOCYC x 1024 Position  */
#define HSMCI_DTOR_DTOMUL_4096                (HSMCI_DTOR_DTOMUL_4096_Val << HSMCI_DTOR_DTOMUL_Pos) /* (HSMCI_DTOR) DTOCYC x 4096 Position  */
#define HSMCI_DTOR_DTOMUL_65536               (HSMCI_DTOR_DTOMUL_65536_Val << HSMCI_DTOR_DTOMUL_Pos) /* (HSMCI_DTOR) DTOCYC x 65536 Position  */
#define HSMCI_DTOR_DTOMUL_1048576             (HSMCI_DTOR_DTOMUL_1048576_Val << HSMCI_DTOR_DTOMUL_Pos) /* (HSMCI_DTOR) DTOCYC x 1048576 Position  */
#define HSMCI_DTOR_Msk                        _UINT32_(0x0000007F)                                 /* (HSMCI_DTOR) Register Mask  */


/* -------- HSMCI_SDCR : (HSMCI Offset: 0x0C) (R/W 32) SD/SDIO Card Register -------- */
#define HSMCI_SDCR_SDCSEL_Pos                 _UINT32_(0)                                          /* (HSMCI_SDCR) SDCard/SDIO Slot Position */
#define HSMCI_SDCR_SDCSEL_Msk                 (_UINT32_(0x3) << HSMCI_SDCR_SDCSEL_Pos)             /* (HSMCI_SDCR) SDCard/SDIO Slot Mask */
#define HSMCI_SDCR_SDCSEL(value)              (HSMCI_SDCR_SDCSEL_Msk & (_UINT32_(value) << HSMCI_SDCR_SDCSEL_Pos)) /* Assigment of value for SDCSEL in the HSMCI_SDCR register */
#define   HSMCI_SDCR_SDCSEL_SLOTA_Val         _UINT32_(0x0)                                        /* (HSMCI_SDCR) Slot A is selected.  */
#define HSMCI_SDCR_SDCSEL_SLOTA               (HSMCI_SDCR_SDCSEL_SLOTA_Val << HSMCI_SDCR_SDCSEL_Pos) /* (HSMCI_SDCR) Slot A is selected. Position  */
#define HSMCI_SDCR_SDCBUS_Pos                 _UINT32_(6)                                          /* (HSMCI_SDCR) SDCard/SDIO Bus Width Position */
#define HSMCI_SDCR_SDCBUS_Msk                 (_UINT32_(0x3) << HSMCI_SDCR_SDCBUS_Pos)             /* (HSMCI_SDCR) SDCard/SDIO Bus Width Mask */
#define HSMCI_SDCR_SDCBUS(value)              (HSMCI_SDCR_SDCBUS_Msk & (_UINT32_(value) << HSMCI_SDCR_SDCBUS_Pos)) /* Assigment of value for SDCBUS in the HSMCI_SDCR register */
#define   HSMCI_SDCR_SDCBUS_1_Val             _UINT32_(0x0)                                        /* (HSMCI_SDCR) 1 bit  */
#define   HSMCI_SDCR_SDCBUS_4_Val             _UINT32_(0x2)                                        /* (HSMCI_SDCR) 4 bits  */
#define   HSMCI_SDCR_SDCBUS_8_Val             _UINT32_(0x3)                                        /* (HSMCI_SDCR) 8 bits  */
#define HSMCI_SDCR_SDCBUS_1                   (HSMCI_SDCR_SDCBUS_1_Val << HSMCI_SDCR_SDCBUS_Pos)   /* (HSMCI_SDCR) 1 bit Position  */
#define HSMCI_SDCR_SDCBUS_4                   (HSMCI_SDCR_SDCBUS_4_Val << HSMCI_SDCR_SDCBUS_Pos)   /* (HSMCI_SDCR) 4 bits Position  */
#define HSMCI_SDCR_SDCBUS_8                   (HSMCI_SDCR_SDCBUS_8_Val << HSMCI_SDCR_SDCBUS_Pos)   /* (HSMCI_SDCR) 8 bits Position  */
#define HSMCI_SDCR_Msk                        _UINT32_(0x000000C3)                                 /* (HSMCI_SDCR) Register Mask  */


