Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.10.212/samv70b/include/component/hsmci.h
/* -------- HSMCI_SR : (HSMCI Offset: 0x40) ( R/ 32) Status Register -------- */
#define HSMCI_SR_CMDRDY_Pos                   _UINT32_(0)                                          /* (HSMCI_SR) Command Ready (cleared by writing in HSMCI_CMDR) Position */
#define HSMCI_SR_CMDRDY_Msk                   (_UINT32_(0x1) << HSMCI_SR_CMDRDY_Pos)               /* (HSMCI_SR) Command Ready (cleared by writing in HSMCI_CMDR) Mask */
#define HSMCI_SR_CMDRDY(value)                (HSMCI_SR_CMDRDY_Msk & (_UINT32_(value) << HSMCI_SR_CMDRDY_Pos)) /* Assigment of value for CMDRDY in the HSMCI_SR register */
#define HSMCI_SR_RXRDY_Pos                    _UINT32_(1)                                          /* (HSMCI_SR) Receiver Ready (cleared by reading HSMCI_RDR) Position */
#define HSMCI_SR_RXRDY_Msk                    (_UINT32_(0x1) << HSMCI_SR_RXRDY_Pos)                /* (HSMCI_SR) Receiver Ready (cleared by reading HSMCI_RDR) Mask */
#define HSMCI_SR_RXRDY(value)                 (HSMCI_SR_RXRDY_Msk & (_UINT32_(value) << HSMCI_SR_RXRDY_Pos)) /* Assigment of value for RXRDY in the HSMCI_SR register */
#define HSMCI_SR_TXRDY_Pos                    _UINT32_(2)                                          /* (HSMCI_SR) Transmit Ready (cleared by writing in HSMCI_TDR) Position */
#define HSMCI_SR_TXRDY_Msk                    (_UINT32_(0x1) << HSMCI_SR_TXRDY_Pos)                /* (HSMCI_SR) Transmit Ready (cleared by writing in HSMCI_TDR) Mask */
#define HSMCI_SR_TXRDY(value)                 (HSMCI_SR_TXRDY_Msk & (_UINT32_(value) << HSMCI_SR_TXRDY_Pos)) /* Assigment of value for TXRDY in the HSMCI_SR register */
#define HSMCI_SR_BLKE_Pos                     _UINT32_(3)                                          /* (HSMCI_SR) Data Block Ended (cleared on read) Position */
#define HSMCI_SR_BLKE_Msk                     (_UINT32_(0x1) << HSMCI_SR_BLKE_Pos)                 /* (HSMCI_SR) Data Block Ended (cleared on read) Mask */
#define HSMCI_SR_BLKE(value)                  (HSMCI_SR_BLKE_Msk & (_UINT32_(value) << HSMCI_SR_BLKE_Pos)) /* Assigment of value for BLKE in the HSMCI_SR register */
#define HSMCI_SR_DTIP_Pos                     _UINT32_(4)                                          /* (HSMCI_SR) Data Transfer in Progress (cleared at the end of CRC16 calculation) Position */
#define HSMCI_SR_DTIP_Msk                     (_UINT32_(0x1) << HSMCI_SR_DTIP_Pos)                 /* (HSMCI_SR) Data Transfer in Progress (cleared at the end of CRC16 calculation) Mask */
#define HSMCI_SR_DTIP(value)                  (HSMCI_SR_DTIP_Msk & (_UINT32_(value) << HSMCI_SR_DTIP_Pos)) /* Assigment of value for DTIP in the HSMCI_SR register */
#define HSMCI_SR_NOTBUSY_Pos                  _UINT32_(5)                                          /* (HSMCI_SR) HSMCI Not Busy Position */
#define HSMCI_SR_NOTBUSY_Msk                  (_UINT32_(0x1) << HSMCI_SR_NOTBUSY_Pos)              /* (HSMCI_SR) HSMCI Not Busy Mask */
#define HSMCI_SR_NOTBUSY(value)               (HSMCI_SR_NOTBUSY_Msk & (_UINT32_(value) << HSMCI_SR_NOTBUSY_Pos)) /* Assigment of value for NOTBUSY in the HSMCI_SR register */
#define HSMCI_SR_SDIOIRQA_Pos                 _UINT32_(8)                                          /* (HSMCI_SR) SDIO Interrupt for Slot A (cleared on read) Position */
#define HSMCI_SR_SDIOIRQA_Msk                 (_UINT32_(0x1) << HSMCI_SR_SDIOIRQA_Pos)             /* (HSMCI_SR) SDIO Interrupt for Slot A (cleared on read) Mask */
#define HSMCI_SR_SDIOIRQA(value)              (HSMCI_SR_SDIOIRQA_Msk & (_UINT32_(value) << HSMCI_SR_SDIOIRQA_Pos)) /* Assigment of value for SDIOIRQA in the HSMCI_SR register */
#define HSMCI_SR_SDIOWAIT_Pos                 _UINT32_(12)                                         /* (HSMCI_SR) SDIO Read Wait Operation Status Position */
#define HSMCI_SR_SDIOWAIT_Msk                 (_UINT32_(0x1) << HSMCI_SR_SDIOWAIT_Pos)             /* (HSMCI_SR) SDIO Read Wait Operation Status Mask */
#define HSMCI_SR_SDIOWAIT(value)              (HSMCI_SR_SDIOWAIT_Msk & (_UINT32_(value) << HSMCI_SR_SDIOWAIT_Pos)) /* Assigment of value for SDIOWAIT in the HSMCI_SR register */
#define HSMCI_SR_CSRCV_Pos                    _UINT32_(13)                                         /* (HSMCI_SR) CE-ATA Completion Signal Received (cleared on read) Position */
#define HSMCI_SR_CSRCV_Msk                    (_UINT32_(0x1) << HSMCI_SR_CSRCV_Pos)                /* (HSMCI_SR) CE-ATA Completion Signal Received (cleared on read) Mask */
#define HSMCI_SR_CSRCV(value)                 (HSMCI_SR_CSRCV_Msk & (_UINT32_(value) << HSMCI_SR_CSRCV_Pos)) /* Assigment of value for CSRCV in the HSMCI_SR register */
#define HSMCI_SR_RINDE_Pos                    _UINT32_(16)                                         /* (HSMCI_SR) Response Index Error (cleared by writing in HSMCI_CMDR) Position */
#define HSMCI_SR_RINDE_Msk                    (_UINT32_(0x1) << HSMCI_SR_RINDE_Pos)                /* (HSMCI_SR) Response Index Error (cleared by writing in HSMCI_CMDR) Mask */
#define HSMCI_SR_RINDE(value)                 (HSMCI_SR_RINDE_Msk & (_UINT32_(value) << HSMCI_SR_RINDE_Pos)) /* Assigment of value for RINDE in the HSMCI_SR register */
#define HSMCI_SR_RDIRE_Pos                    _UINT32_(17)                                         /* (HSMCI_SR) Response Direction Error (cleared by writing in HSMCI_CMDR) Position */
#define HSMCI_SR_RDIRE_Msk                    (_UINT32_(0x1) << HSMCI_SR_RDIRE_Pos)                /* (HSMCI_SR) Response Direction Error (cleared by writing in HSMCI_CMDR) Mask */
#define HSMCI_SR_RDIRE(value)                 (HSMCI_SR_RDIRE_Msk & (_UINT32_(value) << HSMCI_SR_RDIRE_Pos)) /* Assigment of value for RDIRE in the HSMCI_SR register */
#define HSMCI_SR_RCRCE_Pos                    _UINT32_(18)                                         /* (HSMCI_SR) Response CRC Error (cleared by writing in HSMCI_CMDR) Position */
#define HSMCI_SR_RCRCE_Msk                    (_UINT32_(0x1) << HSMCI_SR_RCRCE_Pos)                /* (HSMCI_SR) Response CRC Error (cleared by writing in HSMCI_CMDR) Mask */
#define HSMCI_SR_RCRCE(value)                 (HSMCI_SR_RCRCE_Msk & (_UINT32_(value) << HSMCI_SR_RCRCE_Pos)) /* Assigment of value for RCRCE in the HSMCI_SR register */
#define HSMCI_SR_RENDE_Pos                    _UINT32_(19)                                         /* (HSMCI_SR) Response End Bit Error (cleared by writing in HSMCI_CMDR) Position */
#define HSMCI_SR_RENDE_Msk                    (_UINT32_(0x1) << HSMCI_SR_RENDE_Pos)                /* (HSMCI_SR) Response End Bit Error (cleared by writing in HSMCI_CMDR) Mask */
#define HSMCI_SR_RENDE(value)                 (HSMCI_SR_RENDE_Msk & (_UINT32_(value) << HSMCI_SR_RENDE_Pos)) /* Assigment of value for RENDE in the HSMCI_SR register */
#define HSMCI_SR_RTOE_Pos                     _UINT32_(20)                                         /* (HSMCI_SR) Response Time-out Error (cleared by writing in HSMCI_CMDR) Position */
#define HSMCI_SR_RTOE_Msk                     (_UINT32_(0x1) << HSMCI_SR_RTOE_Pos)                 /* (HSMCI_SR) Response Time-out Error (cleared by writing in HSMCI_CMDR) Mask */
#define HSMCI_SR_RTOE(value)                  (HSMCI_SR_RTOE_Msk & (_UINT32_(value) << HSMCI_SR_RTOE_Pos)) /* Assigment of value for RTOE in the HSMCI_SR register */
#define HSMCI_SR_DCRCE_Pos                    _UINT32_(21)                                         /* (HSMCI_SR) Data CRC Error (cleared on read) Position */
#define HSMCI_SR_DCRCE_Msk                    (_UINT32_(0x1) << HSMCI_SR_DCRCE_Pos)                /* (HSMCI_SR) Data CRC Error (cleared on read) Mask */
#define HSMCI_SR_DCRCE(value)                 (HSMCI_SR_DCRCE_Msk & (_UINT32_(value) << HSMCI_SR_DCRCE_Pos)) /* Assigment of value for DCRCE in the HSMCI_SR register */
#define HSMCI_SR_DTOE_Pos                     _UINT32_(22)                                         /* (HSMCI_SR) Data Time-out Error (cleared on read) Position */
#define HSMCI_SR_DTOE_Msk                     (_UINT32_(0x1) << HSMCI_SR_DTOE_Pos)                 /* (HSMCI_SR) Data Time-out Error (cleared on read) Mask */
#define HSMCI_SR_DTOE(value)                  (HSMCI_SR_DTOE_Msk & (_UINT32_(value) << HSMCI_SR_DTOE_Pos)) /* Assigment of value for DTOE in the HSMCI_SR register */
#define HSMCI_SR_CSTOE_Pos                    _UINT32_(23)                                         /* (HSMCI_SR) Completion Signal Time-out Error (cleared on read) Position */
#define HSMCI_SR_CSTOE_Msk                    (_UINT32_(0x1) << HSMCI_SR_CSTOE_Pos)                /* (HSMCI_SR) Completion Signal Time-out Error (cleared on read) Mask */
#define HSMCI_SR_CSTOE(value)                 (HSMCI_SR_CSTOE_Msk & (_UINT32_(value) << HSMCI_SR_CSTOE_Pos)) /* Assigment of value for CSTOE in the HSMCI_SR register */
#define HSMCI_SR_BLKOVRE_Pos                  _UINT32_(24)                                         /* (HSMCI_SR) DMA Block Overrun Error (cleared on read) Position */
#define HSMCI_SR_BLKOVRE_Msk                  (_UINT32_(0x1) << HSMCI_SR_BLKOVRE_Pos)              /* (HSMCI_SR) DMA Block Overrun Error (cleared on read) Mask */
#define HSMCI_SR_BLKOVRE(value)               (HSMCI_SR_BLKOVRE_Msk & (_UINT32_(value) << HSMCI_SR_BLKOVRE_Pos)) /* Assigment of value for BLKOVRE in the HSMCI_SR register */
#define HSMCI_SR_FIFOEMPTY_Pos                _UINT32_(26)                                         /* (HSMCI_SR) FIFO empty flag Position */
#define HSMCI_SR_FIFOEMPTY_Msk                (_UINT32_(0x1) << HSMCI_SR_FIFOEMPTY_Pos)            /* (HSMCI_SR) FIFO empty flag Mask */
#define HSMCI_SR_FIFOEMPTY(value)             (HSMCI_SR_FIFOEMPTY_Msk & (_UINT32_(value) << HSMCI_SR_FIFOEMPTY_Pos)) /* Assigment of value for FIFOEMPTY in the HSMCI_SR register */
#define HSMCI_SR_XFRDONE_Pos                  _UINT32_(27)                                         /* (HSMCI_SR) Transfer Done flag Position */
#define HSMCI_SR_XFRDONE_Msk                  (_UINT32_(0x1) << HSMCI_SR_XFRDONE_Pos)              /* (HSMCI_SR) Transfer Done flag Mask */
#define HSMCI_SR_XFRDONE(value)               (HSMCI_SR_XFRDONE_Msk & (_UINT32_(value) << HSMCI_SR_XFRDONE_Pos)) /* Assigment of value for XFRDONE in the HSMCI_SR register */
#define HSMCI_SR_ACKRCV_Pos                   _UINT32_(28)                                         /* (HSMCI_SR) Boot Operation Acknowledge Received (cleared on read) Position */
#define HSMCI_SR_ACKRCV_Msk                   (_UINT32_(0x1) << HSMCI_SR_ACKRCV_Pos)               /* (HSMCI_SR) Boot Operation Acknowledge Received (cleared on read) Mask */
#define HSMCI_SR_ACKRCV(value)                (HSMCI_SR_ACKRCV_Msk & (_UINT32_(value) << HSMCI_SR_ACKRCV_Pos)) /* Assigment of value for ACKRCV in the HSMCI_SR register */
#define HSMCI_SR_ACKRCVE_Pos                  _UINT32_(29)                                         /* (HSMCI_SR) Boot Operation Acknowledge Error (cleared on read) Position */
#define HSMCI_SR_ACKRCVE_Msk                  (_UINT32_(0x1) << HSMCI_SR_ACKRCVE_Pos)              /* (HSMCI_SR) Boot Operation Acknowledge Error (cleared on read) Mask */
#define HSMCI_SR_ACKRCVE(value)               (HSMCI_SR_ACKRCVE_Msk & (_UINT32_(value) << HSMCI_SR_ACKRCVE_Pos)) /* Assigment of value for ACKRCVE in the HSMCI_SR register */
#define HSMCI_SR_OVRE_Pos                     _UINT32_(30)                                         /* (HSMCI_SR) Overrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0) Position */
#define HSMCI_SR_OVRE_Msk                     (_UINT32_(0x1) << HSMCI_SR_OVRE_Pos)                 /* (HSMCI_SR) Overrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0) Mask */
#define HSMCI_SR_OVRE(value)                  (HSMCI_SR_OVRE_Msk & (_UINT32_(value) << HSMCI_SR_OVRE_Pos)) /* Assigment of value for OVRE in the HSMCI_SR register */
#define HSMCI_SR_UNRE_Pos                     _UINT32_(31)                                         /* (HSMCI_SR) Underrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0) Position */
#define HSMCI_SR_UNRE_Msk                     (_UINT32_(0x1) << HSMCI_SR_UNRE_Pos)                 /* (HSMCI_SR) Underrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0) Mask */
#define HSMCI_SR_UNRE(value)                  (HSMCI_SR_UNRE_Msk & (_UINT32_(value) << HSMCI_SR_UNRE_Pos)) /* Assigment of value for UNRE in the HSMCI_SR register */
#define HSMCI_SR_Msk                          _UINT32_(0xFDFF313F)                                 /* (HSMCI_SR) Register Mask  */


